{"meta":{"title":"Max","subtitle":null,"description":"Make a little difference to the world","author":"Maxx","url":"http://yoursite.com"},"pages":[{"title":"categories","date":"2018-07-04T03:46:57.000Z","updated":"2018-07-04T03:47:32.541Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2018-07-04T03:13:44.000Z","updated":"2018-07-04T03:48:21.116Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""},{"title":"about-me","date":"2018-07-04T03:49:24.000Z","updated":"2018-07-04T03:49:55.382Z","comments":true,"path":"about-me/index.html","permalink":"http://yoursite.com/about-me/index.html","excerpt":"","text":""}],"posts":[{"title":"BNN","slug":"BNN","date":"2018-07-04T04:36:57.000Z","updated":"2018-07-04T05:00:08.031Z","comments":true,"path":"2018/07/04/BNN/","link":"","permalink":"http://yoursite.com/2018/07/04/BNN/","excerpt":"類神經與深度學習導論期末專案對照片做性別辨識預測使用 Keras 卷積神經網路 (CNN) 辨識性別 那什麼是CNN呢?","text":"類神經與深度學習導論期末專案對照片做性別辨識預測使用 Keras 卷積神經網路 (CNN) 辨識性別 那什麼是CNN呢? model = Sequential() model.add(Conv2D(32, (3, 3), input_shape=(height, width, channel))) model.add(BatchNormalization(axis=-1)) model.add(Activation('relu')) model.add(Conv2D(32, (3, 3))) model.add(BatchNormalization(axis=-1)) model.add(Activation('relu')) model.add(MaxPooling2D(pool_size=(4, 4))) model.add(Conv2D(64, (3, 3))) model.add(BatchNormalization(axis=-1)) model.add(Activation('relu')) model.add(Conv2D(64, (3, 3))) model.add(BatchNormalization(axis=-1)) model.add(Activation('relu')) model.add(MaxPooling2D(pool_size=(6, 6))) model.add(Flatten()) # Fully connected layer model.add(Dense(512)) model.add(BatchNormalization()) model.add(Activation('relu')) model.add(Dropout(0.2)) model.add(Dense(2)) model.add(Softmax()) model.summary() model.compile(loss='binary_crossentropy', optimizer=Adam(), metrics=['accuracy'])","categories":[{"name":"機器學習","slug":"機器學習","permalink":"http://yoursite.com/categories/機器學習/"}],"tags":[{"name":"Python","slug":"Python","permalink":"http://yoursite.com/tags/Python/"},{"name":"keras","slug":"keras","permalink":"http://yoursite.com/tags/keras/"}]},{"title":"Keras疑問整理","slug":"Keras-questions","date":"2018-07-04T04:29:59.000Z","updated":"2018-07-04T04:33:44.951Z","comments":true,"path":"2018/07/04/Keras-questions/","link":"","permalink":"http://yoursite.com/2018/07/04/Keras-questions/","excerpt":"Python: Keras疑問整理by NyngWang","text":"Python: Keras疑問整理by NyngWang ===Sequential()只有第一層需要指定input_dim(因為它沒有上一層)，接下來加入的層就不用了，他們會自動取得上一層的維度。input_shape不包含batch dimension。 model.compile()的功能是?用來設定訓練方式(損失函數) 為什麼圖片要轉成float32型別?train_image.reshape(60000, 784).astype(&#39;float32&#39;) np_utils.to_categorical()的功能是什麼?其實就是轉成one-hot labelsource from stackoverflow: https://stackoverflow.com/a/43314437/5290519function signature: np_utils.to_categorical(y, nb_classes=None).e.g.y: [1,0,2]nb_classes: 3output: [[0,1,0], [1,0,0], [0,0,1]] np.hstack的功能? print(model.summary())的功能是?印出建好的CNN結構 _________________________________________________________________ Layer (type) Output Shape Param # ================================================================= dense_1 (Dense) (None, 256) 200960 _________________________________________________________________ dense_2 (Dense) (None, 10) 2570 ================================================================= Total params: 203,530 Trainable params: 203,530 Non-trainable params: 0 _________________________________________________________________ Keras開發概念圖 Awesome繼續https://www.youtube.com/watch?v=RznKVRTFkBY&amp;list=PLZbbT5o_s2xrwRnXk_yCPtnqqo4_u2YGL GPU+CPUsupported backend: Theano, cntk, tensorflow 所以才要載backend跟keras。儲存訓練好的資料：HDF5 keras GPU版本：cuDNNhttps://github.com/keras-team/keras/issues/9567https://developer.nvidia.com/rdp/cudnn-archive","categories":[{"name":"Python","slug":"Python","permalink":"http://yoursite.com/categories/Python/"}],"tags":[{"name":"Python","slug":"Python","permalink":"http://yoursite.com/tags/Python/"},{"name":"機器學習","slug":"機器學習","permalink":"http://yoursite.com/tags/機器學習/"}]},{"title":"English Translator Competition","slug":"Translator","date":"2018-07-04T03:56:11.000Z","updated":"2018-07-04T04:24:07.100Z","comments":true,"path":"2018/07/04/Translator/","link":"","permalink":"http://yoursite.com/2018/07/04/Translator/","excerpt":"English Translator CompetitionLv1 基本句型單數、雙數不定代名詞Everybody, Someone..關係代名詞時態筆記in, on, at + 時間時間介係詞們冠詞詳細使用情況指導 [name=Waterball][name=Xuan][name=Lin][name=Yan]","text":"English Translator CompetitionLv1 基本句型單數、雙數不定代名詞Everybody, Someone..關係代名詞時態筆記in, on, at + 時間時間介係詞們冠詞詳細使用情況指導 [name=Waterball][name=Xuan][name=Lin][name=Yan] 2018/2/11 關係代名詞 + There家裡堆滿了許多吉米愛看的書，有時候我也會偷偷地翻翻幾本來看。 此題應該熟練 There is/are 句型，甚至是There will be, There could be, There have been, There might be …,There 後面可以加助動詞或be動詞，就是不能加動詞 (There have a bird. [x] -&gt; There have been a bird. [o] -&gt; There is a bird. [o])！ [name=WaterBall] There are many books hoarded home which Jimmy loves so much. Sometimes I would like to read some of them secretly. [name=Xuan 85] There are many books which Jimmy loves to read filling at home, sometimes I open some of them to read secretly. open some of them to read 太中式了吧 …at home, sometimes… -&gt; …at home. Sometimes … 要斷句，因為沒有連接詞。 [name=Lin 75] The home was filled with books by Jimmy liked that sometimes I also read some of them secretly. with books by which Jimmy liked likes and that sometimes … Jimmy likes 不需要過去式 不然就代表吉米現在不喜歡了 在這題 應該是描述 There are, 雖然不能說你錯， 但是你這句話是在強調「家裡之前被充滿了書」 hoard (vi.) 囤積 be filled with 被填滿 secret (n.) 秘密 (a.) 秘密的 2018/2/12 關係代名詞下次環島時我一定騎著我弟弟剛買的重機去！ [name=WaterBall] I definitely will ride my younger brother’s huge heavy motorbike which he just bought to the journey around the island next time. [name=Xuan 75] Next time go around the island, I will ride the heavy motorcycle which my brother newly bought. *1. When next time go going around the island 沒主詞就要用動名詞 going around the island newly just bought* [name=Lin 85] When next time we riding around Taiwan, I will ride the motorcycle which my brother just bought definitely. 1. When next time we riding around … 雖然文法沒錯，但記住你這裡不是使用現在進行式，而是動名詞(僥倖而已)。只有be Ving 可以代表現在進行式。所以還不如 主詞+Vr 用簡單式就好！ [name=Yan 65] In the next time around the island that I must ride my brotherjust bought heavy motorbikes. *1. In the next time going around the island … around為介係詞 前面需加動詞，因為沒有主詞所以用名詞子句Ving around the island that , I … 這邊若加關係代名詞沒有意義，因為你在描述下一次環島。「必須騎…車」根本就不是在描述環島，只是在描述你要在環島時做的事（是下一句話了）。 I must ride my brother just bought heavy motorbikes. 一句話不能有兩個動詞，這邊才是關係代名詞該被使用的地方，並且用來描述那台重機（見範例），不然你無法翻譯句子。 must 必須跟絕對 語氣跟意思是有差的* motorbikes motorbike 你弟買很多台喔？ just (adv.) 剛剛 huge heavy motorbike 重機 go/ride/drive around the island 某種方式環島 definition (n.) 定義 definite (a.) 絕對的 definitely (adv.) 絕對地, 無疑地 2018/2/13 口語分析＋關係代名詞搞什麼啊你們？ 幹嘛跟我前女友說我習慣使用tab而不是space阿？ 我根本沒有阿，你們知道的。 [name=WaterBall] What’s wrong with you guys?Why did you tell my EX that I use Tabs instead of Spaces? Which I don’t, and all of you should know it! [name=Xuan 50] What the hell are you doing?Why do you tell my ex-girlfriend the thing that I am used to tab instead of space?You know I never have been. *1. What the hell are you doing? 這句是髒話 扣分 Why do did you tell my ex-girlfriend the thing that … I am used to I use tab instead of space. 文法大錯特錯* You know I’ve never been. 現在完成式順序都錯成這樣，連查都不會。而且這句根本就違背原意，毫無意義的句子，文法錯就算了意思也不對。 [name=Lin 45] What wrong with you?Why did you told to my ex(girlfirend) that I always replaced space with tab?You know. I didn’t do that at all. *1. What What’s wrong with you? 查也不查清楚 Why did you told tell 助動詞後面原型 再犯一次這種錯就滾 always replaced 沒有這種用法(永遠+過去式) 不要看到取代就直接翻取代 中文腦袋改不掉 You know 斷句錯誤，請加 that 好嗎，如果不會就去查 know that …，不過 at all 用法不錯。可惜這句還是完全違背原意* [name=Yan 60] What’s problem with you guys?Why did you tell my Ex-girlfriend that I am used to tab instead of space?I am real do not, you guys understand me. I am used to 這句錯得要死 請去查 be used to Ving 怎麼用喔 同書瑄 I am real do not I readlly don’t. 去查助動詞用法 instead of (介係詞) 取代 replace N1 with N2 用N2取代N1 EX 前女友 not at all 完全沒有 此題參考來源在此影片中2:04的地方 2018/2/14 口語分析 + 祈使句我已經說過這是一個爛主意了， 不要再玩你那個無聊至極的遊戲了！ [name=Waterball] I’ve said that this is a bad idea. Stop playing your extremely boring game! [name=Xuan 83] I have already said this is a bad idea. Don’t play that your extremely boring game. *1. I have already said that …, 不必要字眼。又不是敘述有進度且確實完成的事情。 -2 Don’t play that your ….game. play是使役動詞 你何必需要加that 來連接子句? -10 Don’y play… 這句 意義不符 -10* extremely 加分 + 5 [name=Lin 43] I had already said that is a bad idea, please do not play the game which is boring again and again. *1. already 同Xuan -2 said that this is a bad idea. 沒加代名詞不構成that子句。-10 again and again 意思完全錯誤，別亂查一通好嗎？ -10 Don’y play… 這句 意義不符 -10 play the game which is … 此題不需要關係代名詞 語句不順 -10 斷句錯誤 祈使句please do not是第二句了 前面需要句號 -5 I had have 時態錯誤 - 10* [name=Yan 95] I have told you that this is a bad idea,Don’t play your boring game anymore. *1. 斷句錯誤 祈使句Don’t 是第二句了 前面需要句號 -5 你Don’t play 這句因為有加 anymore 所以意義符合題目 不必扣分:D!* anymore (adv.) 再 extremely (adv.) 極度地 Stop Ving 停止… 2018/2/16 時態你昨晚回家的時候我就已經清理好所有房間了，所以現在我正在做功課了。 因為大家的時態能力明顯低弱，所以開始只訓練十二時態。只要挑錯時態的就直接扣四十分。時態筆記 [name=Waterball] I had cleaned all the rooms when you came home last night, so now, I’m doing my homework.[name=Xuan 94] When you went home yesterday night, I had cleaned all rooms. So I’m doing my homework now.1. all the rooms[name=Lin 95] When you came home last night, I had already cleaned all rooms. So I’m doing my homework now.1. all the rooms[name=Yan 100] When you came home last night, I had already cleaned up all the rooms, so I’m doing my homework right now. 大家時態都正確無誤：「以過去的時間作為基準點描述已經完成的事情」→過去式+過去完成式 Good 要加 the 是因為這個對話彼此都知道房間是指哪些房間，沒有加the的話會變成「泛指所有所有的房間」，較屬於誇飾法或是口語強調。 clean up 清理乾淨 last night 昨晚 2018/2/21 時態 + 口語分析明天中午十二點你會用車嗎？因為我可能也需要出門。 [name=Waterball] Will you be using the car at tomorrow twelve o’clock? Because I might go out at that time.[name=Xuan 90] Will you use the car tomorrow at 12 p.m.? Because maybe I will drive out.[name=Lin 85] Will you drive the car at tomorrow noon? Because maybe I will need it, too.1. 沒有句子承接too[name=Yan 90] Will you use the car tomorrow noon? Because I may also need to go out. 2018/2/22 時態這把雨傘是在1942年由John發明出來的，至今還是最有價值的雨傘。 [name=Waterball] This umbrella was invented by John in 1942, and it has been the most valuable umbrella one so far.[name=Xuan 85] This umbrella was invented by John in 1942. To date, it is still a most valuable umbrella. 1. a the most valuable [name=Lin 85] This umbrella was invented by John in 1942, it’s still the best one until now. 1. 沒連接詞要斷句 [name=Yan 95] This umbrella was invented by John in 1942, and it is still the most valuable umbrella until now. so far, until now, to date (adv.) 至今 valuable (a.) 有價值的、珍貴的 2018/2/23 時態我習慣每天早上十點出去晨跑，然後中午再去拜訪奶奶。 12:20公布解答請稍等 [name=Waterball] I’m used to jogging at ten o’clock every morning and then paying a visit to my grandmother at noon.[name=Xuan 60] I’m used to go jogging every morning at ten o’clock, and then visit my grandmother at noon. *1. be used to Ving - 20 and 後面承接同一個文法表習慣 be used to Ving - 10* [name=Lin 50] I’m used to jogging at ten o’clock and going to visit my grandma at twelve o’clock afterward.此答案是經歷過很強烈的暗示後才得以形成的 扣50分…翻譯就是要翻到你100%確定無誤，交一個垃圾上來給我改就別交了 1. 中午 != at twelve o’clock 少亂翻了 - 5 [name=Yan 90] I’m used to going jogging at ten o’clock every morning and then I visit my grandmother at noon. 1. and 後面承接同一個文法表習慣 be used to Ving - 10 afterward (adv.) 之後 then (adv.) 然後、當時 visit (v.) 拜訪 pay a visit to sb. 看清楚，then 是副詞！不能當連接詞用！所以前面要加連接詞 and! 2018/2/24 時態 + 口語分析是阿，我都會去公園帶我家的狗散步，只是現在都沒時間了而已。 [name=Waterball] Well, I used to walk my dog in the park, but I don’t have enough time doing this anymore. [name=Xuan 85] Yes. I used to walk my dog in the park, but now I just have no time to do. 1. 第二句冗餘字一堆，意義不對，多看Android文章或機器學習文章看看外國人怎麼講話培養語感 -10 [name=Lin 85] Yeah, I used to walk my dog at the park and I just have no time for it now. *1. and 連接詞思考清楚 只有你用 and - 5 I just have no .. 冗餘* [name=Yan 90] Yes, I used to walk my dog to the park, but I don’t have too much time now. 1. to the park 是 前往公園的意思，介係詞慎選 大家都猜對時態了，真是不錯！used to Vr 跟 be used to Ving 的差別在於 前者是「只有過去才有的習慣」(過去式)，後者則是「至今都還延續的習慣」(現在式)！ walk my dog 帶狗散步 talk a walk 散步 2018/2/25 時態 + 口語分析 (LV 2)&quot;嘿！Lisa又再哭了！&quot; &quot;好啦，你趕快去買午餐，你回家前我就已經處理好了！&quot; 這題不要想得太複雜，把十二時態想清楚才是重點，然後不要強迫症地把每個中文口語翻得清清楚楚，但是重點文字不能少。 [name=Waterball] “Hey! Lisa is crying again!”“Okay! Go buying our lunch quickly. I will have handled this when you come back.”[name=Xuan 80] “Hey! Lisa is crying again.”“Okay, buy your lunch quickly. I will have handled it well before you will come home.” 1.before you will come home, 時間副詞子句用現在式取代未來式，這是小學程度常識，你根本從來都沒看過 before + will，而且查一下很難嗎? 一定要我告訴妳嗎?或者要我告訴你在筆記的哪裡呢?? [name=Lin 40] Hey! Lisa is crying again.Allright, hurry up, you just go buying lunch, I will have finished it before you got home. *1. Alright 拼錯 - 10 你連字都會打錯不如別翻譯了，自律都不會，你交一個沒確認過的東西上來幹嘛?浪費我時間的? you just go buying lunch 整句話意義不明，冗餘又一堆，你為什麼這麼喜歡自以為是亂加 just，因為你某種程度上不會自律跟反省嗎，前幾題才犯過，那別當工程師了，去7-11。 -15 finished it 你想把他殺了是嗎?查都不會，自學都不會還想去碩班給人電嗎?在網路上確定你的句子是正確的很難嗎?學新的字 deal with 很難嗎? - 10 before you got get home. 你前一句用未來完成式，後面一句用過去式? 根本沒再三仔細檢查你自己的思路吧，你真的有看中我們給你學英文的機會嗎? 說真的想打什麼就打什麼也不再三確認，你是要我瞧不起你的智商嗎? 任何一個小學生都知道如果有網路可以參考就不該犯這種錯 -30* 你有拿筆記本作筆記嗎，沒有拜託回去南華你很快就會忘記所有學過的東西，然後一輩子學不好英文，就連上一次犯得錯這次都繼續犯了我完全無言，這跟文法能力無關好嗎，跟一個人是不是想學好英文有關。 [name=Yan 65] Hey! Lisa cried again!Well, hurry up to buy lunch. I’ve done before you return home. *1. I’ve done 意義也不太切題，處理的話有很多種用法，deal with, handle, 都可以，done只單純代表完成某件事情 - 10 Lisa cried is crying again! 要用現在進行式，很遺憾時態錯了 - 20* deal with, handle 處理 (兩個都非常重要) hurry up to Vr 趕快去.. 你趕快去買午餐，這句用祈使句就能表達完整，你們為啥就一定要翻出「你」跟「趕快」？口語分析就是找出這句中文實際上在英文裡能多簡單還不失本意→ Buy our lunch quickly. 或是 Go buying our lunch. 這兩句祈使句都有你趕快去買午餐的語氣！ 2018/2/16 時態 + 口語分析&quot;John，你在幹嘛&quot; &quot;自從妳睡著之後我到現在都一直在讀書啊&quot; &quot;令人驚訝...&quot; [name=Waterball] “John, What are you doing?”“I have been studying since you fell asleep.”“Amazing…”[name=Xuan 100] “What are you doing, John?”“I have been studying since you were asleep.”“Amazing…”[name=Lin 60] John, what are you doing?I’ve studied since you slept.What a surprise… 1. 現在完成式並沒辦法表達「持續進行」，I’ve studied 聽起來只像是：我已經讀完書了。十二時態請認真思考，這次只有你失敗，腦袋太簡單了我會考這麼無聊的題目嗎。 [name=Yan 97] John, what are you doing?I have been studying all the time since you fell asleep.Wow 1. wow 屁 wow 讚 fall asleep 睡著 amazing 令人驚訝 2018/2/27 時態&quot;勤奮跟毅力塑造一個人的成功。&quot; &quot;嗯，有道理。&quot; &quot;那你出門前關燈了嗎?&quot; &quot;喔，忘了。&quot; [name=Waterball] “Diligence and perseverance make one successful.”“Yes, this makes sense.”“But did you turn off the lights before you left home?”“Oh, I forgot.” [name=Xuan 100] “Diligence and persistence can shape one’s success.”“Um.. It makes sense.”“Did you turn off the light before you went out?”“Oh. I forgot.” [name=Lin 50] Diligence and perseverance shape one person who is success.You’ve got a point there.Did you have already turned off the light before you went out?Oh shoot! I forgot it. *1. one person who is success 關係代名詞在這題並沒有切題，你的意思會變成「塑造一個人，而這個人是成功的。」，請參考他人的並改進思維，更不用說success是名詞不是形容詞，但反正都錯了 - 10。 Did you have already Vpp.. 並沒有這個時態，請不要自創時態，用Did就是過去簡單式。 - 30 Oh shoot! 題目看起來這個人有很驚訝嗎? -5* [name=Yan 93] “Diligence and perseverance can create a person’s success.”“Quite reasonable.”“Did you turn off the light before you went out?”oh, I forgot. 1. create a person’s success 這個用法不自然，請參考他人 -2 這題考的其實是現在簡單式 (真理、格言)以及過去簡單式(你有關燈嗎?, 我忘了。) 然後你們的 light 都沒加s，其實是錯的，家裡有很多扇燈的，但運氣好題目並不強調這點。 make sense. 有意義/有道理 You’ve got a point there. 你說得有道理 diligence (n.) 勤奮 perseverance (n.) persevere (v.) 堅持、恆心 persistence (n.) persist (v.) 堅持 shape one’s success 塑造一個人的成功 (超加分用法) turn off 關掉 (有開關的東西) reasonable (a.) 可以解釋的、有道理的 quite (adv.) 相當 success (n.) succeed (v.) successful (a.) 成功 2018/2/28 時態 + 口語分析 + that 子句&quot;欸，你有去看那場演唱會嗎？&quot; &quot;喔有阿，我超不爽的，在表演開始之前我跟我朋友至少等了1小時！&quot; &quot;活該！我早就勸你別去了！&quot; [name=Waterball] “Hey, did you attend that concert?”“Oh, yes I did. I was so angry. My friends and I had waited for at least 1 hour when the performance began!”“You deserve it! I’ve advised you that you should not go!” [name=Xuan 20] “Hey, have you seen to that concert?”“Oh, yes. I’m so unhappy because I waited at least one hour with my friend before the performance started.”“Deserve it. I have advised you not to go!” *1. see to Sth. 是 留意某物 的意思，使役用法跟非使役用法都要查清楚再用。 -10 I was so unhappy. -30 because I had waited for at least.. 請參考我答案 -30 You deserve/deserved it. -5* 只是句子變比較多而已，你就搞砸了。所以請積極閱讀時態筆記。 [name=Lin 45] Hey, did you go to see the concert?Yeah, it is getting on my nerves that I and my friend had waited at least one hour before the concert started.You deserve it! I advised you before. *1. it was getting on my nerves. -30 had waited for at least.. -10 the concert started 並不是表演開始的意思 -10* [name=Yan 25] Hey , did you go to the concert?Yes, but I am really pissed , I waited for friend at least one hour before the concert started!You deserve it ! I have advised you not to go! *1. but I was really.. -30 pissed off 是很生氣的意思，但為口語(髒)用法，用簡單的It made me angry不就好了?* I had waited for -30 waited for friend 題目並不是說在等朋友… -10* 看來你們還是沒辦法掌握小學英文那就繼續幹時態，好想考被動式都不能考。 wait (for) + 時間 等待了一段時間 concert (n.) 演唱會 performance (n.) 表演、性能 it is getting on my nerves 這讓我生氣/緊張 at least 至少 attend (at) 出席 2018/3/2 時態 + 口語分析(嚴重提醒別強迫症)&quot;沒有關係，大家都會有機會。&quot; &quot;11個禮拜之後的各位，都將進行著期末報告。&quot; &quot;別責罵我，請責罵銘傳！&quot; 請慎選時態… [name=Waterball] “That’s okay, everybody will have a chance.”“You will be doing a final presentation in 11 weeks.”“Don’t blame me, please blame Ming Chuan.” [name=Xuan 75] “It doesn’t matter. Everyone has a chance.”“Everyone after 11 weeks will be doing a final report.”“Don’t scold me, please scold Ming Chuan!” *1. 時間介係詞不要亂放位子，放頭+逗號或尾巴，語感有夠差的。 -5 after in 11 weeks. 請參考時間介係詞們 -5 final report presentation. , report是新聞的那種報告，將新的發現或消息以詞語彙報。意思差很多查清楚再用。-10* [name=Lin 85] That’s OK. Everyone will get a chance.Everyone will be having a final presentation at eleven weeks later.please scold ming-chuan, not me. *1. at in eleven weeks later. 請參考時間介係詞們 -5 ming-chuan Ming Chuan 連查學校名都不會，還有你有看過小寫人名嗎 -5* [name=Yan 68] Don’t worry , Everyone has a chance.Each person will have the final presentation after eleven weeksPlease , don’t blame me, blame the school. *1. at in eleven weeks later. 請參考時間介係詞們 -5 have the a final presentation 要去查清楚the跟a/an的差異 -5 Each person will have be having a final presentation… 在未來某個時間點正在進行某件事情→未來進行式 -104.the school Ming Chuan 題目要你翻譯的是銘傳，你不能擅自加入主觀 -5 然後你的標點符號依然沒有經過整理，所以-2* 各位要好好看清楚我的句子，完完全全跟你們想得不一樣。一直用everyone代表你的英文語感很差勁，另外”大家都會有機會”根據上下文，其實要翻譯成未來式will have a chance，使用everyone has chance 只說明你根本是用google翻譯出來的(缺乏人類的語言智慧)。 blame, scold (v.) 責備 presentation (n.) 呈現、報告 report (v.)(n.) 彙報、調查結果、回報、新聞報告 It doesn’t matter. 那不要緊/那不影響 That’s okay. 沒關係 2018/3/3 時態 + 被動式&quot;專家系統在當時是被認為前途光明的，可惜最後已失敗收場。&quot; [name=Waterball] Expert system was considered promising then. Unfortunately, it ended up in failure. [name=Xuan 68] The system of expert was considered as a bright future at that time, unfortunately, it failed at the end. *1. The system of expert Expert system -10 was considered as a bright future 是某東西被認為是個明亮未來，並不代表被認為 有 明亮未來 -10 unfortunately 前要斷句 -2 at in the end 請參考 at the end 還是 in the end -5* [name=Lin 55] Expert system was considered as a bright future system at that time. Unfortunately, it is failed in the end. *1. was considered as a bright future system 是某東西被認為是個明亮未來之系統，並不代表被認為是有明亮未來的系統 -10 it is was failed -30* [name=Yan 90] Expert system was considered to have the bright future at that time, but unfortunately it turned out to be a failure. 1. the a bright future. 之前也犯了一樣的錯，你真的應該要搞清楚a/an跟the -5 fail (v) 失敗 (另外請不要用 be failed 在外國人眼中這是一個文法對，但很奇怪的用法！) failure (n.) 失敗 it turns out to be 結果是.. it turns out that + 子句 結果… Expert system 專家系統 be considered as N 被認為是.. promising (a.) 前途光明的 end up in N 以…收尾 unfortunately (adv.) 可惜、遺憾地 此題是源自於 2018/3/4 With the help of藉由一般用途GPU的幫助下，模型中資料的數量正在迅速增長。 [name=Waterball] With the help of general-purpose GPUs, the size of model data is increasing rapidly. [name=Xuan 100] With the help of general purpose GPU, the amount of data in the model is growing rapidly. [name=Lin 93] With the help of General Purpose GPU, the number of data in the model is growing fast. *1. general purpose 首字小寫 形容詞都拿來當名子了? -2 請把迅速地 rapidly學起來，只有你沒有去學這個字。* [name=Yan 93] With the help of GPU which is used in general purpose, the number of the data in the module is increasing rapidly 模型是 model，這是機器學習專有名詞。 -2 注意, With the help of N 只要是名詞都要加 a/an 或 the 或 複數名詞, 這裡不扣分是因為如果不加冠詞則可以代表一般意義 (泛指一般GPU)，僥倖過關，但我知道你們根本沒想到這件事情，參閱冠詞詳細使用情況指導。 with the help of N 藉由…的幫助 general-purpose (a.) 一般用途 increase (v.) 增加 decrease (v.) 減少 這才是數字增加/減少的最正確動詞！！！ the amount of N (通常接不可數名詞) ..的數量 the number of N (通常接可數名詞) ..的數量 rapidly (adv.) 迅速地 2018/3/5 prefer/ rather than + 口語分析&quot;走啊，一起去爬山。&quot; &quot;不了，比起爬山我還寧願在家裡讀書一整天。&quot; &quot;我看你是寧願變胖吧！&quot; 這題，用到的文法非常難，請認真地一次學好來！每種用法都要記！我保證每種都超重要！不然你一定會忘記！ [name=Waterball] “Let’s climb the mountain.”“Nope, I would rather stay home and read the book whole day than climb the mountain.”“I think you’d prefer to become fatter!” [name=Xuan 100 Excellent] “Go. Let’s go mountain-climbing.”“No. I’d rather study at home all day than go climbing.”“I think you would prefer to gain weight. [name=Lin 100 Excellent] Come on, Let’s go mountain climbing. Nope, I would rather study at home whole day than go mountain climbing. I think you would rather gain weight. 你們兩個應該都查同個地方吧，有夠蠢… [name=Yan 90] Let’s go, go hiking together.No, I would rather stay at home to study all day long than going hiking.I think you would rather get fat. *1. go hiking 是 徒步旅行，本身並沒有爬山的意思唷 -5 than + Vr 原型 -5* 2018/3/9 Definition資料探勘是一個把現有資料，利用某種演算法，來萃取出資訊的一個過程，而涉及到的資料通常非常巨量。 [name=Waterball] Data mining is the process of extracting information from existing data by certain algorithms, as well as the data involved usually is very enormous. [name=Xuan Absent] [name=Lin 80] Data mining is a process of extracting information from existing data by using a specific algorithm, and it usually involve a data which is very huge. *1. it usually involves -5 a data 不可數 -5 involes huge data 就好，不用一堆冗餘關係代名詞 -5* [name=Yan 70] Data mining is some kinds of algorithm, which takes the existing data to extract and the data it involves is usually huge. is some kinds of algorithm process … 資料探勘並不是演算法，而是藉由演算法來執行的一個過程，定義面不符合題意 -10。 is some kinds a kind of process 單數 -5 which takes the existing data to extract 沒有詳細表達出萃取出資訊的部分，並且語感較為不通順，請參考正解 -10* process (n.) 過程 existing (a.) 現有的、存在的 certain (a.) 某種、某些 as well as (conj.) 以及 involve (v) 涉及了 enormous, huge (a.) 巨大 specific (a.) 詳細的、特定的、明確的、具體的 2018/3/10 Definition如果感知器並不能拿來執行XOR的運算，那麼他的成長就受到嚴重限制。 [name=Waterball] If perceptron cannot compute XOR operations, then its growth is severely restricted. [name=Xuan 90] If the perceptron cannot perform the XOR operation, it growth will be limited severely. *1. it its growth -5 這題表一般含意，因此the perceptron, the XOR operation，皆是合法卻多餘的用法 -5* [name=Lin 50] If the sensor can not executing to compute of XOR, and then it will be having a serious restrictions of growing. *1. sensor perceptron -5 can not + Vr -10 executing to compute of XOR, execute 用法你完全沒看 -10 and then 前面就已經有if了，不需要連接詞 -5。 it will be Ving 在這裡完全不適合用 -10 a serious restrictions 你都加 a 了還複數? -5* [name=Yan 95] If perceptron can’t be executed the calculation of XOR, then its growth will be severely restricted. 1. be executed the calculation 句子不通順，execute 的受詞是 Perceptron，這樣你後面的 the calculation of XOR ，就會是多餘的不合法補語，基本上完全是你硬加的 -5 perceptron (n.) 感知器、感知 perceive (v.) 感知、察覺 execute (v.) 執行 compute (v.) 運算 perform (v.) 表現、運算、履行 severely (adv.) 嚴重地 (比serious還嚴重) restriction (n.) 限制 restrict (v.) 2018/3/11 時態 (無壓力題)&quot;妳真的是我見過最漂亮的女人&quot; &quot;你見過多少漂亮女人?&quot; &quot;除了你之外就沒有了&quot; [name=Waterball] “You are the most beautiful woman I’ve ever seen.”“How many pretty women have you ever seen?”“There would be no, besides you.” [name=Xuan 95] “You are really the most beautiful woman I have seen.”“How many beautiful women have you seen?”“No one but you.” [name=Lin 95] You are the most beautiful woman I’ve ever seen.How many beautiful women have you seen?No one but you. [name=Yan 95] You are the most beautiful woman I’ve seen.How many beautiful women have you seen?Except for you, no more. except for 跟 except 的差別注意一下，這題比較適合用 except except (prep.) 除了..之外 (與同類物件比較) except for (prep.) 除了..之外 (與不同類物件比較) 連結 2018/3/12 時態 + 口語分析&quot;爺爺已經過世三年了，我依然想著他。&quot; &quot;記得你答應過他要戒菸，是吧。&quot; &quot;10天內我一定戒掉！走著瞧！&quot; Hint: has died for three years 這句用法是錯的，死亡這個動作並不會持續三年之久，只是過去一瞬間的。 [name=Waterball] “Three years have passed since my grandfather died. I’m still thinking of him.”“Remember that you promised him you will quit smoking, wasn’t it?”“I would definitely get rid of it in 10 days! Just wait and see!” [name=Xuan 95] “Grandpa has already passed away for three years, but I still miss him.”“Remember you promised him to quit smoking, right?”“I will definitely quit in ten days. We’ll see about that.” [name=Lin 60] It had been three years since grandpa passed away, I still miss him.I remember what you promised him to quit smoking, right?I will have achieved it within ten days! Just wait and see. *1. it has been three years -20 what that -10 未來完成式 不太通順 -5* [name=Yan 40] My grandpa has died for three years, but I still miss him.Remember you used to promise him you quit smoking, don’t you?I must quit it in ten days! Let’s see! *1. 上面不是講不能用 has died 嗎，哈哈 -20 used to + Vr 表過去習慣，這裡很單純的 promised 就夠了 -10 promise him you will quit smoking -20 don’t you? didn’t you 你採取了涉及時態的寫法，所以只好扣一點時態分了 -5* 今天這題其實時態筆記也有 pass away (v.) 去世 (可表完成式) quit (v.) 離開、放棄 quit smoking 戒菸 Just wait and see, We will see about that 咱走著瞧 2018/3/13 輕鬆會話題&quot;你明天幾點要出門?&quot; &quot;可能早上9點出門吧&quot; &quot;那你要怎麼去學校&quot; &quot;騎車或搭車吧?&quot; [name=Waterball] “What time will you (set off/ leave home/ go out)?”“Maybe nine o’clock in the morning.”“Then how do you go to school?”“Maybe by riding or taking the bus?” [name=Xuan 90] “What time will you go out tomorrow?”“Maybe I will go out at nine a.m.”“How will you go to school?”“Riding or taking.” 1. taking the bus, 為什麼不打完整 -5 [name=Lin 95] What time will you go out tomorrow?Maybe at nine o’clock in the morning.How do you go to school?Riding or taking the bus. [name=Yan 90] What time do you have to go out tomorrow?Maybe 9am.How do you go to school?Ride or take a car? 1. Riding or taking the car bus, 講述名詞時請用Ving -5 set off/ go out/ leave home 出門, 出發 take the bus 搭公車 2018/3/15 人生題人之所以賴床是因為想成功的慾望不及想呼吸的慾望。 [name=Waterball][name=Xuan][name=Lin][name=Yan]","categories":[],"tags":[{"name":"English","slug":"English","permalink":"http://yoursite.com/tags/English/"}]},{"title":"Vocabulary Lists","slug":"English-Vocabulary-Lists","date":"2018-07-04T02:43:03.000Z","updated":"2018-07-04T05:21:22.431Z","comments":true,"path":"2018/07/04/English-Vocabulary-Lists/","link":"","permalink":"http://yoursite.com/2018/07/04/English-Vocabulary-Lists/","excerpt":"遇到不懂得單字或片語，記錄下來就對了。123456789101112131415161718192021222324fit sth out - 為…提供一切必要的東西；裝備，配備to supply someone or something with all of the things that will be neededleave sb/sth out - 除去；撇開；忽略to not include someone or somethingdignity - 莊重，端莊；尊嚴calm, serious, and controlled behaviour that makes people respect youjudgment - 判斷力；識別力he ability to form valuable opinions and make good decisionsenchant - 使陶醉；使入迷to attract or please someone very muchfutile - （行動）無作用的；無效的；不成功的(of actions) having no effect or achieving nothingattorney - 律師a lawyerpossession - 擁有，佔有；具有the fact that you have or own something","text":"遇到不懂得單字或片語，記錄下來就對了。123456789101112131415161718192021222324fit sth out - 為…提供一切必要的東西；裝備，配備to supply someone or something with all of the things that will be neededleave sb/sth out - 除去；撇開；忽略to not include someone or somethingdignity - 莊重，端莊；尊嚴calm, serious, and controlled behaviour that makes people respect youjudgment - 判斷力；識別力he ability to form valuable opinions and make good decisionsenchant - 使陶醉；使入迷to attract or please someone very muchfutile - （行動）無作用的；無效的；不成功的(of actions) having no effect or achieving nothingattorney - 律師a lawyerpossession - 擁有，佔有；具有the fact that you have or own something suspendbar temporarily amendmake revisions to marginthe boundary line or area immediately inside the boundary accomplishachieve with effort equivalentbeing essentially equal to something rivalthe contestant you hope to defeat contracta binding agreement that is enforceable by law riskyinvolving risk or danger accordconcurrence of opinion additionalfurther or extra defecta failing or deficiency discussto consider or examine in speech or writing commercetransactions supplying goods and services appropriatesuitable for a particular person, place, or situation authorizegrant permission or clearance for acceptreceive willingly something given or offered lawyera professional person authorized for legal practice attorneya professional person authorized to practice law detaileddeveloped with careful treatment of particulars negotiatediscuss the terms of an arrangement profitthe advantageous quality of being beneficial competitiveinvolving rivalry over something cooperativeinvolving the joint activity of two or more dissolvepass into a solution wordingthe manner in which something is expressed in words abidedwell implementa piece of equipment or a tool used for a specific purpose 附上單字庫的網址英語腦內大革命 契約by WaterBall","categories":[{"name":"English Vocabulary","slug":"English-Vocabulary","permalink":"http://yoursite.com/categories/English-Vocabulary/"}],"tags":[{"name":"Vocabulary","slug":"Vocabulary","permalink":"http://yoursite.com/tags/Vocabulary/"}]},{"title":"Hello World","slug":"hello-world","date":"2018-06-26T06:40:43.859Z","updated":"2018-06-26T06:40:43.859Z","comments":true,"path":"2018/06/26/hello-world/","link":"","permalink":"http://yoursite.com/2018/06/26/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}